# вариант 18
# Дано трехзначное число. В нем зачеркнули первое число и вставили его в конце. Вывести
#открытие цикла с условием завершение - вывода True
while True:
    try:
        # Запрашиваем ввод у пользователя и веденные данные всегда считываются как строка
        user_input = input("Ввод трехзначного числа: ")

        # преобразование вода в число
        # если ввели буквы  возникнет ошибка ValueError и программа перейдет в блок except
        number = int(user_input)
        #проверка что число не отрицательное так как по условию не должно быть обяз обычное трехзначное
        if number < 0:
            print("Ошибка: Число не должно быть отрицательным!")
        # проверяем является ли число трехзначным от 100 до 999
        # условие работать ток с 3х значными
        elif 100 <= number <= 999:
            # number % 100 получаем последние две цифры ,пример из 123 получаем 23
            # * 10 сдвигаем их влево получаем 230
            # number делим на 100 получаем первую цифру из 123 получаем 1
            # складываем и получаем результат 230 + 1 = 231
            result = (number % 100) * 10 + (number // 100)

            # выводим итоговый результат на экран
            print("Полученное число:", result)
            #цикл завершается бриком
            break
        #если if условие не выполнилось то работает этот блок
        else:
            #принт ошибки не выполненного условия
            print("Ошибка: Пожалуйста, введите именно трехзначное число.")

    #except работает как вывод ошибки в паре с try
    except ValueError:
        #    блок сработает если int() не сможет перевести текст в число
        print("Ошибка: Вы ввели не число! Пожалуйста, используйте только цифры.")

