try:
    # Запрашиваем ввод у пользователя веденные данные всегда считываются как строка
    user_input = input("Ввод трехзначного числа: ")

    # Пытаемся преобразовать строку в целое число
    # Если пользователь ввел буквы здесь возникнет ошибка ValueError и программа перейдет в блок except
    number = int(user_input)

    # Проверяем является ли число трехзначным от 100 до 999
    # условие работать ток с 3х значными
    if 100 <= number <= 999:
        # Логика сдвига цифр
        # number % 100 получаем последние две цифры ,пример из 123 получаем 23
        # * 10 сдвигаем их влево получаем 230
        # number // 100 получаем первую цифру из 123 получаем 1
        # Складываем и получаем результат 230 + 1 = 231
        result = (number % 100) * 10 + (number // 100)

        # Выводим итоговый результат на экран
        print("Полученное число:", result)
    else:
        print("Ошибка: Пожалуйста, введите именно трехзначное число.")

except ValueError:
    #  блок сработает если int() не сможет перевести текст в число
    print("Ошибка: Вы ввели не число! Пожалуйста, используйте только цифры.")
